# Homebrew Brewfile for dotfiles setup
# Install with: brew bundle --file ~/dotfiles/brew/Brewfile

# Taps
tap "databricks/tap"
tap "homebrew/cask-fonts"

# Shell & Terminal Tools
# =====================
# Terminal multiplexer
brew "tmux"
# Cross-shell prompt with git integration
brew "starship"
# Modern replacement for ls
brew "eza"
# Clone of cat with syntax highlighting
brew "bat"
# Command-line fuzzy finder
brew "fzf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Display directories as trees
brew "tree"
# Symlink farm manager for dotfiles
brew "stow"

# Git Tools
# =========
# GitHub command-line tool
brew "gh"
# Interactive git commands with fzf
brew "forgit"
# Fancy diffs for git
brew "diff-so-fancy"

# Development Tools
# =================
# JavaScript runtime
brew "node"
# Kubernetes command-line tool
brew "kubernetes-cli"
# Run a Kubernetes cluster locally
brew "minikube"
# Process YAML, JSON, XML, CSV documents
brew "yq"

# Cloud & Infrastructure
# ======================
# Command-line interface for Databricks
brew "databricks/tap/databricks"

# Image Processing
# ================
# PostScript and PDF interpreter
brew "ghostscript"
# Graph visualization software
brew "graphviz"
# Image manipulation tools
brew "imagemagick"
# OCR engine
brew "tesseract"

# Python
# ======
# Python 3.14
brew "python@3.14"

# Casks (GUI Applications)
# ========================
# Terminal-based AI coding assistant
cask "claude-code"
# Google Cloud CLI tools
cask "gcloud-cli"
# GPU-accelerated terminal emulator
cask "ghostty"
# Secure tunnels to localhost
cask "ngrok"
# Nerd Font for terminal icons
cask "font-fira-code-nerd-font"

# VS Code Extensions
# ==================
vscode "altimateai.vscode-altimate-mcp-server"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "databricks.databricks"
vscode "databricks.sqltools-databricks-driver"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hashicorp.terraform"
vscode "innoverio.vscode-dbt-power-user"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "mtxr.sqltools"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "samuelcolvin.jinjahtml"
